{
  "architectures": [
    "VideoMAEForVideoClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "decoder_hidden_size": 384,
  "decoder_intermediate_size": 1536,
  "decoder_num_attention_heads": 6,
  "decoder_num_hidden_layers": 4,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "assult",
    "1": "datefight",
    "2": "robbery",
    "3": "burglary",
    "4": "trespass",
    "5": "wander",
    "6": "vandalism",
    "7": "fight",
    "8": "dump",
    "9": "swoon",
    "10": "kidnap"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "assult": 0,
    "burglary": 3,
    "datefight": 1,
    "dump": 8,
    "fight": 7,
    "kidnap": 10,
    "robbery": 2,
    "swoon": 9,
    "trespass": 4,
    "vandalism": 6,
    "wander": 5
  },
  "layer_norm_eps": 1e-12,
  "model_type": "videomae",
  "norm_pix_loss": true,
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_frames": 16,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "transformers_version": "4.56.1",
  "tubelet_size": 2,
  "use_mean_pooling": false
}
